src/SSL.Chat2Desk/src/Catalogs/C2D_WebHooks/C2D_WebHooks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>C2D_WebHooks</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPМетод</name>
    <type>
      <types>EnumRef.C2D_HttpМетоды</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМетода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IDWebHook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/SSL.Chat2Desk/src/HTTPServices/c2d_add_webhook/Module.bsl
#Область ПрограммныйИнтерфейс
Функция c2d_add_webhook(Запрос)
	СтруктураВходящихПараметров = Новый Структура;
	//Получаем имя метода
	ИмяМетода  = Запрос.ПараметрыURL["ИмяМетода"];    
	СтруктураВходящихПараметров.Вставить("ИмяМетода",ИмяМетода); 
	
	//Получим тип запроса
	HTTPМетод = Запрос.HTTPМетод;
	СтруктураВходящихПараметров.Вставить("HTTPМетод", HTTPМетод);
	
	//Забираем параметры из запроса
	ПараметрыЗапроса = Новый Соответствие;
	Для каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
        ПараметрыЗапроса.Вставить(Параметр.Ключ,Параметр.Значение);
    КонецЦикла;
	СтруктураВходящихПараметров.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
	
	//Забираем тело запроса
	ТелоЗапроса = C2D_ВзаимодействиеСApiСлужебный.ДесериализоватьJSON(Запрос.ПолучитьТелоКакСтроку());
	СтруктураВходящихПараметров.Вставить("ТелоЗапроса", ТелоЗапроса);
	
	СтруктураОтвет = ОбработатьВызов(СтруктураВходящихПараметров);
	
	//Создаем ответ с кодом состояния
	Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета); 
	Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.JsonОтвета,КодировкаТекста.UTF8);	
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ОбработатьВызов(СтруктураВходящихПараметров)
	
	//Переправляем на нужный метод
	СтруктураОтвет = Справочники.C2D_WebHooks.ОбработатьВызов(СтруктураВходящихПараметров);

	Возврат СтруктураОтвет;	
	
КонецФункции
#КонецОбласти
